#### 📖 Terraform Plan ('infra/resources/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_resource_group.rg_elt will be created
  + resource "azurerm_resource_group" "rg_elt" {
      + id       = (known after apply)
      + location = "italynorth"
      + name     = "io-p-itn-auth-elt-rg-01"
      + tags     = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Auth&Identity"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }
    }

  # module.eventhub.module.eventhub.azurerm_eventhub.events["io-p-itn-auth-elt-pdnd-io-cosmosdb-profile-deletion-01"] will be created
  + resource "azurerm_eventhub" "events" {
      + id                  = (known after apply)
      + message_retention   = 7
      + name                = "io-p-itn-auth-elt-pdnd-io-cosmosdb-profile-deletion-01"
      + namespace_name      = "io-p-itn-auth-elt-evhns-01"
      + partition_count     = 30
      + partition_ids       = (known after apply)
      + resource_group_name = "io-p-itn-auth-elt-rg-01"
      + status              = "Active"
    }

  # module.eventhub.module.eventhub.azurerm_eventhub.events["io-p-itn-auth-elt-pdnd-io-cosmosdb-profiles-01"] will be created
  + resource "azurerm_eventhub" "events" {
      + id                  = (known after apply)
      + message_retention   = 7
      + name                = "io-p-itn-auth-elt-pdnd-io-cosmosdb-profiles-01"
      + namespace_name      = "io-p-itn-auth-elt-evhns-01"
      + partition_count     = 30
      + partition_ids       = (known after apply)
      + resource_group_name = "io-p-itn-auth-elt-rg-01"
      + status              = "Active"
    }

  # module.eventhub.module.eventhub.azurerm_eventhub.events["io-p-itn-auth-elt-pdnd-io-cosmosdb-service-preferences-01"] will be created
  + resource "azurerm_eventhub" "events" {
      + id                  = (known after apply)
      + message_retention   = 7
      + name                = "io-p-itn-auth-elt-pdnd-io-cosmosdb-service-preferences-01"
      + namespace_name      = "io-p-itn-auth-elt-evhns-01"
      + partition_count     = 30
      + partition_ids       = (known after apply)
      + resource_group_name = "io-p-itn-auth-elt-rg-01"
      + status              = "Active"
    }

  # module.eventhub.module.eventhub.azurerm_eventhub_authorization_rule.authorization_rule["io-p-itn-auth-elt-pdnd-io-cosmosdb-profile-deletion-01.io-fn-elt"] will be created
  + resource "azurerm_eventhub_authorization_rule" "authorization_rule" {
      + eventhub_name                     = "io-p-itn-auth-elt-pdnd-io-cosmosdb-profile-deletion-01"
      + id                                = (known after apply)
      + listen                            = false
      + manage                            = false
      + name                              = "io-fn-elt"
      + namespace_name                    = "io-p-itn-auth-elt-evhns-01"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + resource_group_name               = "io-p-itn-auth-elt-rg-01"
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = true
    }

  # module.eventhub.module.eventhub.azurerm_eventhub_authorization_rule.authorization_rule["io-p-itn-auth-elt-pdnd-io-cosmosdb-profile-deletion-01.pdnd"] will be created
  + resource "azurerm_eventhub_authorization_rule" "authorization_rule" {
      + eventhub_name                     = "io-p-itn-auth-elt-pdnd-io-cosmosdb-profile-deletion-01"
      + id                                = (known after apply)
      + listen                            = true
      + manage                            = false
      + name                              = "pdnd"
      + namespace_name                    = "io-p-itn-auth-elt-evhns-01"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + resource_group_name               = "io-p-itn-auth-elt-rg-01"
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = false
    }

  # module.eventhub.module.eventhub.azurerm_eventhub_authorization_rule.authorization_rule["io-p-itn-auth-elt-pdnd-io-cosmosdb-profiles-01.io-fn-elt"] will be created
  + resource "azurerm_eventhub_authorization_rule" "authorization_rule" {
      + eventhub_name                     = "io-p-itn-auth-elt-pdnd-io-cosmosdb-profiles-01"
      + id                                = (known after apply)
      + listen                            = false
      + manage                            = false
      + name                              = "io-fn-elt"
      + namespace_name                    = "io-p-itn-auth-elt-evhns-01"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + resource_group_name               = "io-p-itn-auth-elt-rg-01"
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = true
    }

  # module.eventhub.module.eventhub.azurerm_eventhub_authorization_rule.authorization_rule["io-p-itn-auth-elt-pdnd-io-cosmosdb-profiles-01.pdnd"] will be created
  + resource "azurerm_eventhub_authorization_rule" "authorization_rule" {
      + eventhub_name                     = "io-p-itn-auth-elt-pdnd-io-cosmosdb-profiles-01"
      + id                                = (known after apply)
      + listen                            = true
      + manage                            = false
      + name                              = "pdnd"
      + namespace_name                    = "io-p-itn-auth-elt-evhns-01"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + resource_group_name               = "io-p-itn-auth-elt-rg-01"
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = false
    }

  # module.eventhub.module.eventhub.azurerm_eventhub_authorization_rule.authorization_rule["io-p-itn-auth-elt-pdnd-io-cosmosdb-service-preferences-01.io-fn-elt"] will be created
  + resource "azurerm_eventhub_authorization_rule" "authorization_rule" {
      + eventhub_name                     = "io-p-itn-auth-elt-pdnd-io-cosmosdb-service-preferences-01"
      + id                                = (known after apply)
      + listen                            = false
      + manage                            = false
      + name                              = "io-fn-elt"
      + namespace_name                    = "io-p-itn-auth-elt-evhns-01"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + resource_group_name               = "io-p-itn-auth-elt-rg-01"
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = true
    }

  # module.eventhub.module.eventhub.azurerm_eventhub_authorization_rule.authorization_rule["io-p-itn-auth-elt-pdnd-io-cosmosdb-service-preferences-01.pdnd"] will be created
  + resource "azurerm_eventhub_authorization_rule" "authorization_rule" {
      + eventhub_name                     = "io-p-itn-auth-elt-pdnd-io-cosmosdb-service-preferences-01"
      + id                                = (known after apply)
      + listen                            = true
      + manage                            = false
      + name                              = "pdnd"
      + namespace_name                    = "io-p-itn-auth-elt-evhns-01"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + resource_group_name               = "io-p-itn-auth-elt-rg-01"
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = false
    }

  # module.eventhub.module.eventhub.azurerm_eventhub_namespace.this will be created
  + resource "azurerm_eventhub_namespace" "this" {
      + auto_inflate_enabled                      = false
      + capacity                                  = 1
      + default_primary_connection_string         = (sensitive value)
      + default_primary_connection_string_alias   = (sensitive value)
      + default_primary_key                       = (sensitive value)
      + default_secondary_connection_string       = (sensitive value)
      + default_secondary_connection_string_alias = (sensitive value)
      + default_secondary_key                     = (sensitive value)
      + id                                        = (known after apply)
      + local_authentication_enabled              = true
      + location                                  = "italynorth"
      + minimum_tls_version                       = (known after apply)
      + name                                      = "io-p-itn-auth-elt-evhns-01"
      + network_rulesets                          = [
          + {
              + default_action                 = "Deny"
              + ip_rule                        = [
                  + {
                      + action  = "Allow"
                      + ip_mask = "18.192.147.151"
                    },
                  + {
                      + action  = "Allow"
                      + ip_mask = "18.159.227.69"
                    },
                  + {
                      + action  = "Allow"
                      + ip_mask = "3.126.198.129"
                    },
                ]
              + public_network_access_enabled  = true
              + trusted_service_access_enabled = false
            },
        ]
      + public_network_access_enabled             = true
      + resource_group_name                       = "io-p-itn-auth-elt-rg-01"
      + sku                                       = "Standard"
      + tags                                      = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Auth&Identity"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }
      + zone_redundant                            = false
    }

  # module.eventhub.module.eventhub.azurerm_monitor_metric_alert.event_hub_health_check["high_cpu_usage"] will be created
  + resource "azurerm_monitor_metric_alert" "event_hub_health_check" {
      + auto_mitigate            = false
      + description              = "Too High CPU Usage"
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "io-p-itn-auth-elt-evhns-01-HIGH_CPU_USAGE"
      + resource_group_name      = "io-p-itn-auth-elt-rg-01"
      + scopes                   = (known after apply)
      + severity                 = 3
      + tags                     = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Auth&Identity"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT15M"

      + action {
          + action_group_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Insights/actionGroups/ioperror"
        }

      + criteria {
          + aggregation            = "Maximum"
          + metric_name            = "CPU"
          + metric_namespace       = "microsoft.eventhub/namespaces"
          + operator               = "GreaterThan"
          + skip_metric_validation = false
          + threshold              = 90
        }
    }

  # module.eventhub.module.eventhub.azurerm_monitor_metric_alert.event_hub_health_check["throttled_requests"] will be created
  + resource "azurerm_monitor_metric_alert" "event_hub_health_check" {
      + auto_mitigate            = false
      + description              = "Too Many Throttled Requests"
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "io-p-itn-auth-elt-evhns-01-THROTTLED_REQUESTS"
      + resource_group_name      = "io-p-itn-auth-elt-rg-01"
      + scopes                   = (known after apply)
      + severity                 = 3
      + tags                     = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Auth&Identity"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT15M"

      + action {
          + action_group_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Insights/actionGroups/ioperror"
        }

      + criteria {
          + aggregation            = "Count"
          + metric_name            = "ThrottledRequests"
          + metric_namespace       = "microsoft.eventhub/namespaces"
          + operator               = "GreaterThan"
          + skip_metric_validation = false
          + threshold              = 20
        }
    }

  # module.eventhub.module.eventhub.azurerm_monitor_metric_alert.event_hub_health_check["user_errors"] will be created
  + resource "azurerm_monitor_metric_alert" "event_hub_health_check" {
      + auto_mitigate            = false
      + description              = "Too Many User Errors"
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "io-p-itn-auth-elt-evhns-01-USER_ERRORS"
      + resource_group_name      = "io-p-itn-auth-elt-rg-01"
      + scopes                   = (known after apply)
      + severity                 = 3
      + tags                     = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Auth&Identity"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT15M"

      + action {
          + action_group_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Insights/actionGroups/ioperror"
        }

      + criteria {
          + aggregation            = "Count"
          + metric_name            = "UserErrors"
          + metric_namespace       = "microsoft.eventhub/namespaces"
          + operator               = "GreaterThan"
          + skip_metric_validation = false
          + threshold              = 0
        }
    }

  # module.eventhub.module.eventhub.azurerm_private_endpoint.event_hub_pep will be created
  + resource "azurerm_private_endpoint" "event_hub_pep" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "italynorth"
      + name                     = "io-p-itn-auth-elt-evhns-pep-01"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "io-p-itn-auth-elt-rg-01"
      + subnet_id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-pep-snet-01"
      + tags                     = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Auth&Identity"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "private-dns-zone-group"
          + private_dns_zone_ids = [
              + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-evt-rg/providers/Microsoft.Network/privateDnsZones/privatelink.servicebus.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "io-p-itn-auth-elt-evhns-pep-01"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "namespace",
            ]
        }
    }

Plan: 15 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
